Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/appealing.html.txt.tmx
Source language: en
Languages: ga

source: Appealing the Decision in a Civil Case
ga: Achomharc ar an gCinneadh

source: If you are unhappy with the result of your case, you may wish to appeal your case to a higher court
ga: Má tá tú míshásta le toradh do cháis, d'fhéadfadh sé go mbeadh fonn ort achomharc a chur ós comhair cúirte níos airde

source: It will mean going through the entire process all over again
ga: Beidh ort tosnú ón tús leis an bpróiséas ar fad

source: If your case was commenced in the District Court, it can be appealed to the Circuit Court
ga: Más sa Chúirt Dúiche a cuireadh tús le do chás is féidir achomharc a chur ós comhair na Cúirte Cuardaí

source: A case commenced in the Circuit Court may be appealed to the High Court
ga: Is féidir achomharc ar chás a bhí sa Chúirt Chuarda a chur ós comhair na hArdchúirte

source: A High Court case may be appealed to the Court of Appeal
ga: Is féidir achomharc ar chás a bhí san Ardchúirt a chur chuig an gCúirt Achomhairc

source: You may choose to appeal the original judge's decision in its entirety, i.e., his/her decision on who was to blame and the damages awarded (if they were awarded), in which case the appeal court may
ga: Is féidir leat achomharc a dhéanadh ar chinneadh an bhreithimh ina iomlán, i.e. a c(h)inneadh ar cé a bhí ciontach agus na damáistí a bhronn sé/sí (má bhronn), sa chás seo is féidir leis an gcúirt achomhairc

source: 1. agree with the decision of the original court and uphold it or 2
ga: • aontú leis an gcinneadh a rinne an chéad chúirt agus seasamh leis nó

source: disagree with the decision of the original court and overturn it or 3
ga: • easaontú leis an gcinneadh a rinne an chéad chúirt agus an cinneadh sin a chur ar neamhní nó

source: increase or decrease the amount of damages awarded
ga: • na damáistí a bronnadh a ardú nó a ísliú

source: If you are happy with decision made by the original judge in relation to who was at fault but unhappy with the amount of damages he/she has awarded, you may appeal the amount of damages awarded only
ga: Má tá tú sásta leis an gcinneadh a rinne an chéad bhreitheamh maidir leis an té a bhí ciontach ach má tá tú míshásta leis an méid damáistí a bhronn sé/sí, is féidir achomharc a lorg ar an méid damáistí a bronnadh amháin

source: Then the appeal court may either increase or decrease the amount of damages awarded by the original judge
ga: Is féidir leis an gcúirt achomhairc ansin na damáistí a bhronn an chéad bhreitheamh a ardú nó a ísliú

source: If you lose your appeal, you will have to pay the costs of both sides so any offers to settle made by the other side should be seriously considered
ga: Muna n-éiríonn leat san achomharc beidh ort costais an dá thaobh a íoc agus mar sin má dhéanann an taobh eile aon tairiscint an cás a réiteach leat ba cheart breathnú ar sin go cúramach
